cf/DataProcessors/РабочееМесто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>РабочееМесто</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/Catalogs/ВидыДлительностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ВидыДлительностей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлительностьВМинутах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/РабочееМесто/Forms/ФормаДобавленияПосетилеля/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 	Элементы.Длительность.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивВидовДлительности());    	
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Отказ	= Ложь;
	
	Если Не ЗначениеЗаполнено(Посетитель) Тогда
		Сообщить("Не выбран посетитель");
		Отказ	= Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидДлительности) Тогда
		Сообщить("Не выбран вид длительности");
		Отказ	= Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Закрыть(Новый Структура("Посетитель, ВидДлительности", Посетитель, ВидДлительности));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивВидовДлительности()

	Запрос	= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ВидыДлительностей.Ссылка КАК Ссылка,
	            	  |	ВидыДлительностей.ДлительностьВМинутах КАК ДлительностьВМинутах,
	            	  |	ВидыДлительностей.Бессрочно КАК Бессрочно
	            	  |ИЗ
	            	  |	Справочник.ВидыДлительностей КАК ВидыДлительностей
	            	  |ГДЕ
	            	  |	НЕ ВидыДлительностей.ПометкаУдаления
	            	  |	И ВидыДлительностей.Активность";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
